In [1]:
import pandas as pd
import numpy as np

## Introduction to pandas Data Structures

### Series

In [2]:
obj = pd.Series([4, 7, -5, 3])

display(obj.index)
display(obj.values)

RangeIndex(start=0, stop=4, step=1)

array([ 4,  7, -5,  3], dtype=int64)

In [3]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [4]:
obj2['a']

-5

In [5]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [6]:
'b' in obj2

True

In [7]:
sdata = {'Ohio': 3500, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

obj3 = pd.Series(sdata)
obj3

Ohio       3500
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [8]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

obj4 = pd.Series(sdata, states)
obj4

California        NaN
Ohio           3500.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [9]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [10]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [11]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [12]:
obj3 + obj4

California         NaN
Ohio            7000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [13]:
obj4.name = 'population'

obj4.index.name = 'state'
obj4

state
California        NaN
Ohio           3500.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [14]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [15]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [16]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [17]:
frame = pd.DataFrame(data, columns=['year', 'state', 'pop'])
frame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [18]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                     index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [19]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [20]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [21]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [22]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [23]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [24]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [25]:
del frame2['debt']
frame2

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9
six    2003  Nevada  3.2

In [26]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [27]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [28]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [29]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}

pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [30]:
frame3.index.name = 'year'

frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [31]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

### Index Objects

In [32]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [33]:
index[1:]

Index(['b', 'c'], dtype='object')

In [34]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [35]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [36]:
2003 in frame3.index

False

## Essential Functionality

### Reindexing

In [37]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [38]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [39]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [40]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

With DataFrame, reindex can alter either the (row) index, columns, or both.

In [41]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                    columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [42]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [43]:
states = ['Texas', 'Utah', 'California']

frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### Dropping Entries from an Axis

In [44]:
new_frame = frame.drop('c')
new_frame

   Ohio  Texas  California
a     0      1           2
d     6      7           8

In [45]:
new_frame = frame.drop(['a', 'c'])
new_frame

   Ohio  Texas  California
d     6      7           8

In [46]:
new_frame = frame.drop('Texas', axis=1)
new_frame

   Ohio  California
a     0           2
c     3           5
d     6           8

In [47]:
frame.drop('Ohio', axis=1, inplace=True)
frame

   Texas  California
a      1           2
c      4           5
d      7           8

### Indexing, Selection, and Filtering

In [48]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [49]:
obj['b']

1.0

In [50]:
obj[1]

1.0

In [51]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [52]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [53]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [54]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [55]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [56]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [57]:
data[['two', 'three']]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [58]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [59]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [60]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [61]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [62]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [63]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [64]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [65]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [66]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Function Application and Mapping

In [67]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.264205 -1.105441 -0.349884
Ohio    0.214963 -0.237496  2.139494
Texas  -0.227098  1.267560  0.254564
Oregon -0.190405  0.319668 -0.132032

In [68]:
np.abs(frame)

               b         d         e
Utah    0.264205  1.105441  0.349884
Ohio    0.214963  0.237496  2.139494
Texas   0.227098  1.267560  0.254564
Oregon  0.190405  0.319668  0.132032

In [69]:
frame.apply(lambda x: x.max() - x.min())

b    0.479168
d    2.373001
e    2.489378
dtype: float64

In [70]:
frame.apply(lambda x: x.max() - x.min(), axis=1)

Utah      0.841235
Ohio      2.376990
Texas     1.494658
Oregon    0.510073
dtype: float64

The function passed to apply need not return a scalar value; it can also return a Series with multiple values.

In [71]:
format = lambda x: '%.2f' % x

frame.applymap(format)

            b      d      e
Utah    -0.26  -1.11  -0.35
Ohio     0.21  -0.24   2.14
Texas   -0.23   1.27   0.25
Oregon  -0.19   0.32  -0.13

In [72]:
frame['e'].map(format)

Utah      -0.35
Ohio       2.14
Texas      0.25
Oregon    -0.13
Name: e, dtype: object

### Sorting and Ranking

In [73]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [75]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [76]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=list('dabc'))
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [77]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [78]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [79]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [80]:
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [82]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [83]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [84]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [85]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [86]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [87]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [89]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [90]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [91]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [92]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [95]:
frame.rank(axis=1)

     b    a
0  2.0  1.0
1  2.0  1.0
2  1.0  2.0
3  2.0  1.0

### Axis Indexes with Duplicate Labels

In [96]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [97]:
obj.index.is_unique

False

In [98]:
obj['a']

a    0
a    1
dtype: int64

## Summarizing and Computing Descriptive Statistics

In [99]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
                 index=list('abcd'), columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [103]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [101]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [104]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

Some methods, like idxmax and idxmin, return indirect statistics like the index value where the minimum or maximum values are attained.

In [107]:
df.idxmax()

one    b
two    d
dtype: object

In [118]:
df2 = pd.DataFrame(np.arange(16).reshape((4, 4)), columns=list('abcd'))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [119]:
df2.drop(df2.b.idxmax(), inplace=True)
df2

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

Other methods are accumulations:

In [116]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [122]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

### Correlation and Covariance

In [125]:
import pandas_datareader.data as web

all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})

volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [131]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-04-03 -0.014371 -0.033273 -0.009210 -0.020485
2020-04-06  0.087237  0.079744  0.074368  0.081102
2020-04-07 -0.011582  0.001045 -0.010770 -0.000345
2020-04-08  0.025595  0.037846  0.010031  0.020034
2020-04-09  0.007216  0.018526  0.000061  0.000967

The corr method of Series computes the correlation of the overlapping, non-NA, aligned-by-index values in two Series. Relatedly, cov computes the covariance.

In [132]:
returns['MSFT'].corr(returns['IBM'])

0.5965826720836669

In [133]:
returns['MSFT'].cov(returns['IBM'])

0.00015996336973686713

DataFrame's corr and cov methods return a full correlation or covariance matrix.

In [134]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.536213  0.695227  0.638896
IBM   0.536213  1.000000  0.596583  0.529846
MSFT  0.695227  0.596583  1.000000  0.744275
GOOG  0.638896  0.529846  0.744275  1.000000

In [135]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000324  0.000150  0.000216  0.000194
IBM   0.000150  0.000241  0.000160  0.000139
MSFT  0.000216  0.000160  0.000298  0.000216
GOOG  0.000194  0.000139  0.000216  0.000284

Using DataFrame's corrwith method, you can compute pairwise correlations between a DataFrame's columns or rows with another Series or DataFrame.<br>
Passing a Series returns a Series with the correlation value computed for each column:

In [136]:
returns.corrwith(returns.IBM)

AAPL    0.536213
IBM     1.000000
MSFT    0.596583
GOOG    0.529846
dtype: float64

Passing a DataFrame computes the correlations of matching column names.

In [137]:
returns.corrwith(volume)

AAPL   -0.141046
IBM    -0.097190
MSFT   -0.036731
GOOG   -0.042955
dtype: float64

### Unique Values, Value Counts, and Membership

In [139]:
obj = pd.Series(list('cadaabbcc'))

obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [140]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [146]:
pd.value_counts(obj.values, sort=False)

c    3
a    3
b    2
d    1
dtype: int64

In [147]:
obj.isin(['b', 'c'])

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In some cases, you may want to compute a histogram on multiple related columns:

In [148]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [149]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

Here, the row labels in the result are the distinct values occurring in all of the columns.